truepass = '132435'
userpass = '0'
alfadic = {'q':'й','w':'ц','e':'у','r':'к','t':'е','y':'н','u':'г','i':'ш','o':'щ','p':'з','[':'х',']':'ъ','a':'ф','s':'ы','d':'в','f':'а','g':'п','h':'р','j':'о','k':'л','l':'д',';':'ж',"'":'э','z':'я','x':'ч','c':'с','v':'м','b':'и','n':'т','m':'ь',',':'б','.':'ю','/':'.'}
print('Введите пароль для доступа к программе:')
'''while truepass != userpass:
  userpass = input()
  if userpass != truepass:
    print('Пароль неверный! Повторите попытку:')
print('Пароль верный!')  
'''
#print(alfadic.get('r'))
s = input('Введите строку\n')
for i in s:
  print(alfadic.get(i), end = '')
